cfe llm/Catalogs/AI_Провайдеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_Провайдеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIКлюч</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксКоличествоПотоков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПровайдерИсточникAPI</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитRPM</Name>
					<Comment>0 — без лимита. Максимум запросов в минуту к провайдеру.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитТокеновВСутки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АдресаСервисов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БазовыйURL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.AI_ТипAPI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_Провайдеры/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ВсеДанныеПровайдера(Провайдер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	AI_Провайдеры.Ссылка КАК Ссылка,
		|	AI_Провайдеры.Наименование КАК Наименование,
		|	AI_Провайдеры.Активен КАК Активен,
		|	AI_Провайдеры.APIКлюч КАК APIКлюч,
		|	AI_Провайдеры.ПровайдерИсточникAPI КАК ПровайдерИсточникAPI,
		|	AI_Провайдеры.МаксКоличествоПотоков КАК МаксКоличествоПотоков,
		|	AI_Провайдеры.ЛимитRPM КАК ЛимитRPM
		|ИЗ
		|	Справочник.AI_Провайдеры КАК AI_Провайдеры
		|ГДЕ
		|	AI_Провайдеры.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	AI_ПровайдерыАдресаСервисов.БазовыйURL КАК БазовыйURL,
		|	AI_ПровайдерыАдресаСервисов.Тип КАК Тип
		|ИЗ
		|	Справочник.AI_Провайдеры.АдресаСервисов КАК AI_ПровайдерыАдресаСервисов
		|ГДЕ
		|	AI_ПровайдерыАдресаСервисов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Провайдер);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	ДанныеПровайдера = РезультатПакет[0].Выбрать();
	ДанныеURL = РезультатПакет[1].Выбрать();
	
	ИтоговаяСтруктура = Новый Структура;
	
	Если ДанныеПровайдера.Следующий() Тогда
		ИтоговаяСтруктура.Вставить("Активен", ДанныеПровайдера.Активен);
		ИтоговаяСтруктура.Вставить("APIКлюч", ДанныеПровайдера.APIКлюч.Получить());
		ИтоговаяСтруктура.Вставить("МаксКоличествоПотоков", ДанныеПровайдера.МаксКоличествоПотоков);
		ИтоговаяСтруктура.Вставить("ЛимитRPM", ДанныеПровайдера.ЛимитRPM);
		ИтоговаяСтруктура.Вставить("ПровайдерИсточникAPI", ДанныеПровайдера.ПровайдерИсточникAPI);
		ИтоговаяСтруктура.Вставить("АдресаСервисов", Новый Соответствие);
	КонецЕсли;
	
	Пока ДанныеURL.Следующий() Цикл
		ИтоговаяСтруктура.АдресаСервисов.Вставить(ДанныеURL.Тип, ДанныеURL.БазовыйURL);
	КонецЦикла;
	
	Возврат ИтоговаяСтруктура;
	
КонецФункции

Функция ТипПоддерживается(Знач Провайдер, ТипАпи) Экспорт
	Если ТипЗнч(Провайдер) = Тип("СправочникСсылка.AI_Провайдеры") Тогда
		СтруктураДанныхПровайдера = ВсеДанныеПровайдера(Провайдер);
	Иначе
		СтруктураДанныхПровайдера = Провайдер;
	КонецЕсли;
	Возврат НЕ СтруктураДанныхПровайдера.АдресаСервисов.Получить(ТипАпи) = Неопределено;
КонецФункции

#КонецОбласти
